{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.8.4",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "emoji_autoencoder",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                128,
                128,
                1
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Model",
            "config": {
              "name": "Encoder",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      128,
                      128,
                      1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_128x128"
                  },
                  "name": "input_128x128",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "Convolution1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                      5,
                      5
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "Convolution1",
                  "inbound_nodes": [
                    [
                      [
                        "input_128x128",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "shrink_64x64",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "strides": [
                      2,
                      2
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "shrink_64x64",
                  "inbound_nodes": [
                    [
                      [
                        "Convolution1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "Convolution2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "Convolution2",
                  "inbound_nodes": [
                    [
                      [
                        "shrink_64x64",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "shrink_32x32",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "strides": [
                      2,
                      2
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "shrink_32x32",
                  "inbound_nodes": [
                    [
                      [
                        "Convolution2",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "Convolution3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "Convolution3",
                  "inbound_nodes": [
                    [
                      [
                        "shrink_32x32",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "shrink_8x8",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                      4,
                      4
                    ],
                    "padding": "same",
                    "strides": [
                      4,
                      4
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "shrink_8x8",
                  "inbound_nodes": [
                    [
                      [
                        "Convolution3",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 8,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d",
                  "inbound_nodes": [
                    [
                      [
                        "shrink_8x8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "MaxPooling2D",
                  "config": {
                    "name": "shrink_4x4",
                    "trainable": true,
                    "dtype": "float32",
                    "pool_size": [
                      2,
                      2
                    ],
                    "padding": "same",
                    "strides": [
                      2,
                      2
                    ],
                    "data_format": "channels_last"
                  },
                  "name": "shrink_4x4",
                  "inbound_nodes": [
                    [
                      [
                        "conv2d",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Flatten",
                  "config": {
                    "name": "matrix_to_vector",
                    "trainable": true,
                    "dtype": "float32",
                    "data_format": "channels_last"
                  },
                  "name": "matrix_to_vector",
                  "inbound_nodes": [
                    [
                      [
                        "shrink_4x4",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "link_flat_to_64x1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "link_flat_to_64x1",
                  "inbound_nodes": [
                    [
                      [
                        "matrix_to_vector",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "output_8x1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 8,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "output_8x1",
                  "inbound_nodes": [
                    [
                      [
                        "link_flat_to_64x1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                }
              ],
              "input_layers": [
                [
                  "input_128x128",
                  0,
                  0
                ]
              ],
              "output_layers": [
                [
                  "output_8x1",
                  0,
                  0
                ]
              ]
            },
            "name": "Encoder",
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "class_name": "Model",
            "config": {
              "name": "Decoder",
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      8
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_8x1"
                  },
                  "name": "input_8x1",
                  "inbound_nodes": []
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "activate_input",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "activate_input",
                  "inbound_nodes": [
                    [
                      [
                        "input_8x1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "name": "link_reshape_64x1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "link_reshape_64x1",
                  "inbound_nodes": [
                    [
                      [
                        "activate_input",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Reshape",
                  "config": {
                    "name": "reshape_8x8",
                    "trainable": true,
                    "dtype": "float32",
                    "target_shape": [
                      8,
                      8,
                      1
                    ]
                  },
                  "name": "reshape_8x8",
                  "inbound_nodes": [
                    [
                      [
                        "link_reshape_64x1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 8,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_1",
                  "inbound_nodes": [
                    [
                      [
                        "reshape_8x8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "UpSampling2D",
                  "config": {
                    "name": "grow_16x16",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                      2,
                      2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                  },
                  "name": "grow_16x16",
                  "inbound_nodes": [
                    [
                      [
                        "conv2d_1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_2",
                  "inbound_nodes": [
                    [
                      [
                        "grow_16x16",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "UpSampling2D",
                  "config": {
                    "name": "grow_32x32",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                      2,
                      2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                  },
                  "name": "grow_32x32",
                  "inbound_nodes": [
                    [
                      [
                        "conv2d_2",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_3",
                  "inbound_nodes": [
                    [
                      [
                        "grow_32x32",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "UpSampling2D",
                  "config": {
                    "name": "grow_64x64",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                      2,
                      2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                  },
                  "name": "grow_64x64",
                  "inbound_nodes": [
                    [
                      [
                        "conv2d_3",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "conv2d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                      3,
                      3
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "conv2d_4",
                  "inbound_nodes": [
                    [
                      [
                        "grow_64x64",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "UpSampling2D",
                  "config": {
                    "name": "grow_128x128",
                    "trainable": true,
                    "dtype": "float32",
                    "size": [
                      2,
                      2
                    ],
                    "data_format": "channels_last",
                    "interpolation": "nearest"
                  },
                  "name": "grow_128x128",
                  "inbound_nodes": [
                    [
                      [
                        "conv2d_4",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                },
                {
                  "class_name": "Conv2D",
                  "config": {
                    "name": "output_128x128",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 1,
                    "kernel_size": [
                      5,
                      5
                    ],
                    "strides": [
                      1,
                      1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                      1,
                      1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                  },
                  "name": "output_128x128",
                  "inbound_nodes": [
                    [
                      [
                        "grow_128x128",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ]
                }
              ],
              "input_layers": [
                [
                  "input_8x1",
                  0,
                  0
                ]
              ],
              "output_layers": [
                [
                  "output_128x128",
                  0,
                  0
                ]
              ]
            },
            "name": "Decoder",
            "inbound_nodes": [
              [
                [
                  "Encoder",
                  1,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "Decoder",
            1,
            0
          ]
        ]
      }
    },
    "training_config": {
      "loss": "mean_squared_error",
      "metrics": null,
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adadelta",
        "config": {
          "name": "Adadelta",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "rho": 0.949999988079071,
          "epsilon": 1e-07
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "activate_input/kernel",
          "shape": [
            8,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "activate_input/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "link_reshape_64x1/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "link_reshape_64x1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/kernel",
          "shape": [
            3,
            3,
            1,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/kernel",
          "shape": [
            3,
            3,
            8,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_2/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/kernel",
          "shape": [
            3,
            3,
            16,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_3/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_4/kernel",
          "shape": [
            3,
            3,
            32,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d_4/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "output_128x128/kernel",
          "shape": [
            5,
            5,
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "output_128x128/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolution1/kernel",
          "shape": [
            5,
            5,
            1,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolution1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolution2/kernel",
          "shape": [
            3,
            3,
            64,
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolution2/bias",
          "shape": [
            32
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolution3/kernel",
          "shape": [
            3,
            3,
            32,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "Convolution3/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/kernel",
          "shape": [
            3,
            3,
            16,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "conv2d/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "link_flat_to_64x1/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "link_flat_to_64x1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "output_8x1/kernel",
          "shape": [
            64,
            8
          ],
          "dtype": "float32"
        },
        {
          "name": "output_8x1/bias",
          "shape": [
            8
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}